Kryptos-FR/NOMI-VR/NOMI-VR_Headset/Build/nomivr_Firmware/motherboard/boards.txt

nomivr_dbg.name=nomivr (Programming Port)
nomivr_dbg.vid.0=0x1209
nomivr_dbg.pid.0=0x000A
nomivr_dbg.vid.1=0x2A03
nomivr_dbg.pid.1=0x000A
nomivr_dbg.upload.tool=bossac
nomivr_dbg.upload.protocol=sam-ba
nomivr_dbg.upload.maximum_size=524288
nomivr_dbg.upload.use_1200bps_touch=true
nomivr_dbg.upload.wait_for_upload_port=false
nomivr_dbg.upload.native_usb=false
nomivr_dbg.build.mcu=cortex-m3
nomivr_dbg.build.f_cpu=84000000L
nomivr_dbg.build.usb_manufacturer="nomivr"
nomivr_dbg.build.usb_product="nomivr"
nomivr_dbg.build.board=SAM_DUE
nomivr_dbg.build.core=arduino
nomivr_dbg.build.extra_flags=-D__SAM3X8E__ -mthumb {build.usb_flags}
nomivr_dbg.build.ldscript=linker_scripts/gcc/flash.ld
nomivr_dbg.build.variant=nomivr
nomivr_dbg.build.variant_system_lib=libsam_sam3x8e_gcc_rel.a
nomivr_dbg.build.vid=0x1209
nomivr_dbg.build.pid=0x000A

nomivr.name=nomivr (Native USB Port)
nomivr.vid.0=0x1209
nomivr.pid.0=0x0009
nomivr.vid.1=0x2A03
nomivr.pid.1=0x0009
nomivr.upload.tool=bossac
nomivr.upload.protocol=sam-ba
nomivr.upload.maximum_size=524288
nomivr.upload.use_1200bps_touch=true
nomivr.upload.wait_for_upload_port=true
nomivr.upload.native_usb=true
nomivr.build.mcu=cortex-m3
nomivr.build.f_cpu=84000000L
nomivr.build.usb_manufacturer="nomivr"
nomivr.build.usb_product="nomivr"
nomivr.build.board=SAM_DUE
nomivr.build.core=arduino
nomivr.build.extra_flags=-D__SAM3X8E__ -mthumb {build.usb_flags}
nomivr.build.ldscript=linker_scripts/gcc/flash.ld
nomivr.build.variant=nomivr
nomivr.build.variant_system_lib=libsam_sam3x8e_gcc_rel.a
nomivr.build.vid=0x1209
nomivr.build.pid=0x0009